# [문제 1]
### nfl_data.csv 파일에는 미국 내셔널 풋볼 리그의 선수 목록이 있습니다.

In [31]:
import pandas as pd

In [32]:
# nfl_data.csv 파일을 읽어들이면서 Birthday 열의 값을 날짜/시간 데이터로 변환하세요
# 변수 : nfl
nfl = pd.read_csv('./nfl_data.csv', parse_dates=['Birthday'])

In [33]:
nfl # 주피터 노트북의 Display 기능

                    Name                  Team Position   Birthday   Salary
0           Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1         Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2            Adam Butler  New England Patriots       DT 1994-04-12   645000
3            Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4              Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000
...                  ...                   ...      ...        ...      ...
1650    Bashaud Breeland    Kansas City Chiefs       CB 1992-01-30   805000
1651         Craig James   Philadelphia Eagles       CB 1996-04-29   570000
1652  Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
1653         Chuma Edoga         New York Jets       OT 1997-05-25   495000
1654        Tajae Sharpe      Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 5 columns]

In [34]:
print(nfl) # print 함수를 사용하면 정교화된 데이터프레임이 아닌 텍스트로 출력됨

                    Name                  Team Position   Birthday   Salary
0           Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1         Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2            Adam Butler  New England Patriots       DT 1994-04-12   645000
3            Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4              Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000
...                  ...                   ...      ...        ...      ...
1650    Bashaud Breeland    Kansas City Chiefs       CB 1992-01-30   805000
1651         Craig James   Philadelphia Eagles       CB 1996-04-29   570000
1652  Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
1653         Chuma Edoga         New York Jets       OT 1997-05-25   495000
1654        Tajae Sharpe      Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 5 columns]

In [35]:
nfl.info() # 데이터프레임의 정보를 출력

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1655 entries, 0 to 1654
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1655 non-null   object
 1   Team      1655 non-null   object
 2   Position  1655 non-null   object
 3   Birthday  1655 non-null   datetime64[ns]
 4   Salary    1655 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 64.8+ KB

In [36]:
nfl.describe() # 통계적 요약(평균, 표준편차, 최소값, 최대값 등)

                            Birthday        Salary
count                           1655  1.655000e+03
mean   1993-04-13 16:24:04.350453120  1.861569e+06
min              1977-08-03 00:00:00  3.780000e+05
25%              1991-06-11 12:00:00  5.700000e+05
50%              1993-12-05 00:00:00  8.000000e+05
75%              1995-09-11 12:00:00  1.839952e+06
max              1998-12-19 00:00:00  2.750000e+07
std                              NaN  2.748519e+06

In [37]:
nfl.sample() # 랜덤하게 1개의 데이터를 출력

            Name             Team Position   Birthday    Salary
145  Eli Manning  New York Giants       QB 1981-01-03  11500000

In [38]:
nfl.value_counts() # value_counts() 함수는 데이터프레임의 각 열에 대해 고유한 값의 개수를 반환합니다.

Name               Team                  Position  Birthday    Salary
Alexander Johnson  Denver Broncos        ILB       1991-12-24  570000     2
Aaron Colvin       Washington Redskins   CB        1991-10-02  7500000    1
Aaron Donald       Los Angeles Rams      DT        1991-05-23  9108000    1
Will Fuller        Houston Texans        WR        1994-04-16  1836043    1
Adrian Phillips    Los Angeles Chargers  SS        1990-01-06  1500000    1
                                                                         ..
Xavier Su'a-Filo   Dallas Cowboys        G         1991-01-01  805000     1
Xavier Williams    Kansas City Chiefs    DT        1992-01-18  2257000    1
Xavier Woods       Dallas Cowboys        FS        1995-07-26  645000     1
Yannick Ngakoue    Jacksonville Jaguars  DE        1994-11-30  2025000    1
Aaron Brewer       Arizona Cardinals     LS        1990-07-05  930000     1
Name: count, Length: 1654, dtype: int64

In [39]:
nfl.head()

             Name                  Team Position   Birthday   Salary
0    Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1  Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2     Adam Butler  New England Patriots       DT 1994-04-12   645000
3     Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4       Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000

In [40]:
# 받아들인 데이터셋에서 선수의 이름을 인덱스 레이블로 설정하세요.
nfl.reset_index(drop=True, inplace=True)
nfl.head()

             Name                  Team Position   Birthday   Salary
0    Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1  Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2     Adam Butler  New England Patriots       DT 1994-04-12   645000
3     Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4       Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000

In [62]:
# 이 데이터셋에서 팀 당 선수가 몇 명인지 구하세요
nfl['Team'].value_counts()

Team
New York Jets           58
Washington Redskins     56
Kansas City Chiefs      56
New Orleans Saints      55
San Francisco 49Ers     55
Denver Broncos          54
Minnesota Vikings       54
Los Angeles Chargers    54
Atlanta Falcons         53
Dallas Cowboys          53
Seattle Seahawks        53
Detroit Lions           53
Buffalo Bills           53
Chicago Bears           53
Philadelphia Eagles     52
New York Giants         52
Los Angeles Rams        52
Houston Texans          52
Arizona Cardinals       51
Oakland Raiders         51
Cincinnati Bengals      51
Green Bay Packers       51
Jacksonville Jaguars    50
New England Patriots    49
Indianapolis Colts      49
Carolina Panthers       49
Cleveland Browns        49
Miami Dolphins          49
Baltimore Ravens        48
Tampa Bay Buccaneers    47
Pittsburgh Steelers     47
Tennessee Titans        46
Name: count, dtype: int64

In [42]:
# 이 데이터셋에서 가장 높은 연봉을 받는 선수 5명을 구하세요
nfl.sort_values(by='Salary', ascending=False).head(5)

                 Name                  Team Position   Birthday    Salary
180      Kirk Cousins     Minnesota Vikings       QB 1988-08-19  27500000
905    Marcus Mariota      Tennessee Titans       QB 1993-10-30  20922000
1623   Jameis Winston  Tampa Bay Buccaneers       QB 1994-01-06  20922000
1343       Derek Carr       Oakland Raiders       QB 1991-03-28  19900000
150   Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

In [49]:
# New York Jets 팀에서 가장 나이가 어린 선수와 그 선수의 생일을 구하세요.
nfl[nfl['Team']=='New York Jets'].sort_values(by='Birthday', ascending=False).head(1)[['Name', 'Birthday']] # []는 Pandas가 읽는 형식,
# 그 안의 []는 Column을 의미

                 Name   Birthday
217  Quinnen Williams 1997-12-21

In [60]:
import pandas as pd
from datetime import datetime

# 예시 데이터 로드 (실제 데이터셋에 맞게 조정 필요)
# nfl = pd.read_csv('nfl_data.csv')

# 현재 날짜 구하기
current_date = datetime.now()

# New York Jets 팀에서 가장 나이가 어린 선수 찾기
youngest_player = nfl[nfl['Team'] == 'New York Jets'].sort_values(by='Birthday', ascending=False).head(1)

# 선수의 생일을 datetime 객체로 변환
youngest_player['Birthday'] = pd.to_datetime(youngest_player['Birthday'])

# 연령 계산
youngest_player['Age'] = current_date.year - youngest_player['Birthday'].dt.year
if current_date.month < youngest_player['Birthday'].dt.month.iloc[0] or \
    (current_date.month <= youngest_player['Birthday'].dt.month.iloc[0]):
    youngest_player['Age'] -= 1

# 이름, 생일, 연령 출력
youngest_player[['Name', 'Birthday', 'Age']]

                 Name   Birthday  Age
217  Quinnen Williams 1997-12-21   26

# [문제 2]

## customers.csv 데이터셋에는 주소(Address) 열이 있습니다.
## 각 주소는 도로，시，주 및 우편번호로 구성됩니다.

In [ ]:
# 주소에서 위 네 가지 값을 분리하고 분리한 값을 각각
# Street, City, State, Zip 이라는 새로운 열에 할당하세요
# 변수 : customers

In [ ]:
# 가장 아래에서부터 5개 행을 확인합니다.

In [ ]:
# Street 열의 4자리 숫자의 모든 항목을 * 표로 치환합니다.

# [문제 3]

## investments.csv 데이터셋은 웹사이트 크런치베이스에 수집한 27,000 개 이상의 스타트업 투자 기록을 담은 데이터셋.

## 각 스타트업에는 이름(Name), 시장(Market), 상태 (Status), 운영하는 주(State)와 투자 라운드(Funding Rounds) 정보가 있습니다.

In [ ]:
investments = pd.read_csv("investments.csv")
investments.head()

In [ ]:
# 각 열의 고유값 개수 식별
investments.nunique()

In [ ]:
# 3레벨 MultiIndex 생성
investments = investments.set_index(
  keys = ["Status", "Funding Rounds", "State"]
).sort_index()

In [ ]:
# 확인
investments.head()

In [ ]:
# Status가 ‘Closed’인 모든 행을 추출

In [ ]:
# Status가 ‘Acquired’이고 Funding Rounds가 10인 모든 행을 추출

In [ ]:
# Status가 ‘Operating’이고 Funding Rounds가 6이고 State가 ‘NJ’인 모든 행을 추출

In [ ]:
# Status가 ‘Closed’이고 Funding Rounds가 8인 모든 행을 추출하세요. 이때 Name 열만 추출

In [ ]:
# Status나 Funding Rounds의 값과 상관없이 State가 ‘NJ’인 모든 행을 추출

In [ ]:
# Multilndex 레벨을 DataFrame에 열로 다시 통합